#if !defined FUNCTION_H
#define FUNCTION_H

/////////////////////////////////////////////////////////////////////////////
#define PI 3.14159265358979
#define E  2.71828182845905
/////////////////////////////////////////////////////////////////////////////
class Function
{
public:
	// номер варианта
	int m_variant;
	// конструктор
	Function();
	// деструктор
	~Function();

	// проба функции f(x)
	double Proba(double x);
	// проба интеграла (вычисленного аналитически) функции f(x) на интервале [a,b] 
	double ProbaIntegral(double a, double b);
};
/////////////////////////////////////////////////////////////////////////////
#endif